artillery_attack.txt
----------------------------30000----------------------------

Started phase 0, duration: 20s @ 11:06:50(+0800) 2020-06-22
Report @ 11:07:00(+0800) 2020-06-22
Elapsed time: 10 seconds
  Scenarios launched:  399
  Scenarios completed: 143
  Requests completed:  143
  Mean response/sec: 40.18
  Response time (msec):
    min: 315
    max: 6393.7
    median: 3423.6
    p95: 6158.3
    p99: 6380.4
  Codes:
    200: 143

Warning:
CPU usage of Artillery seems to be very high (pids: 32)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 11:07:10(+0800) 2020-06-22
Elapsed time: 20 seconds
  Scenarios launched:  400
  Scenarios completed: 148
  Requests completed:  148
  Mean response/sec: 40.04
  Response time (msec):
    min: 6410.8
    max: 12600.2
    median: 9554.9
    p95: 12319.7
    p99: 12579.3
  Codes:
    200: 148

Report @ 11:07:20(+0800) 2020-06-22
Elapsed time: 30 seconds
  Scenarios launched:  1
  Scenarios completed: 149
  Requests completed:  149
  Mean response/sec: 0.1
  Response time (msec):
    min: 12705
    max: 18929.6
    median: 15868.4
    p95: 18689.5
    p99: 18912.5
  Codes:
    200: 149

Report @ 11:07:30(+0800) 2020-06-22
Elapsed time: 40 seconds
  Scenarios launched:  0
  Scenarios completed: 156
  Requests completed:  156
  Mean response/sec: NaN
  Response time (msec):
    min: 19029.8
    max: 25084.1
    median: 22161.2
    p95: 24830.5
    p99: 25066.8
  Codes:
    200: 156

Report @ 11:07:40(+0800) 2020-06-22
Elapsed time: 50 seconds
  Scenarios launched:  0
  Scenarios completed: 158
  Requests completed:  158
  Mean response/sec: NaN
  Response time (msec):
    min: 25105.3
    max: 31090.5
    median: 28124
    p95: 30819.5
    p99: 31054.8
  Codes:
    200: 158

Report @ 11:07:43(+0800) 2020-06-22
Elapsed time: 53 seconds
  Scenarios launched:  0
  Scenarios completed: 46
  Requests completed:  46
  Mean response/sec: NaN
  Response time (msec):
    min: 31128.6
    max: 32893.6
    median: 31984.3
    p95: 32792.5
    p99: 32893.6
  Codes:
    200: 46

All virtual users finished
Summary report @ 11:07:43(+0800) 2020-06-22
  Scenarios launched:  800
  Scenarios completed: 800
  Requests completed:  800
  Mean response/sec: 15.1
  Response time (msec):
    min: 315
    max: 32893.6
    median: 17264.4
    p95: 31343.7
    p99: 32581.1
  Scenario counts:
    0: 800 (100%)
  Codes:
    200: 800

----------------------------20000----------------------------
Started phase 0, duration: 20s @ 11:09:09(+0800) 2020-06-22
Report @ 11:09:19(+0800) 2020-06-22
Elapsed time: 10 seconds
  Scenarios launched:  399
  Scenarios completed: 210
  Requests completed:  210
  Mean response/sec: 40.18
  Response time (msec):
    min: 298.3
    max: 4721.5
    median: 2587.7
    p95: 4528.2
    p99: 4661.3
  Codes:
    200: 210

Warning:
CPU usage of Artillery seems to be very high (pids: 4788)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 11:09:29(+0800) 2020-06-22
Elapsed time: 20 seconds
  Scenarios launched:  400
  Scenarios completed: 220
  Requests completed:  220
  Mean response/sec: 40.04
  Response time (msec):
    min: 4731
    max: 9236.8
    median: 6984.3
    p95: 9015.4
    p99: 9224.5
  Codes:
    200: 220

Report @ 11:09:39(+0800) 2020-06-22
Elapsed time: 30 seconds
  Scenarios launched:  1
  Scenarios completed: 227
  Requests completed:  227
  Mean response/sec: 0.1
  Response time (msec):
    min: 9241.7
    max: 13505.7
    median: 11473.2
    p95: 13305.1
    p99: 13494.9
  Codes:
    200: 227

Report @ 11:09:45(+0800) 2020-06-22
Elapsed time: 36 seconds
  Scenarios launched:  0
  Scenarios completed: 143
  Requests completed:  143
  Mean response/sec: NaN
  Response time (msec):
    min: 13554.6
    max: 16087.3
    median: 14791
    p95: 15965.7
    p99: 16084.3
  Codes:
    200: 143

All virtual users finished
Summary report @ 11:09:45(+0800) 2020-06-22
  Scenarios launched:  800
  Scenarios completed: 800
  Requests completed:  800
  Mean response/sec: 21.94
  Response time (msec):
    min: 298.3
    max: 16087.3
    median: 8626.2
    p95: 15373.4
    p99: 15963.1
  Scenario counts:
    0: 800 (100%)
  Codes:
    200: 800


----------------------------18500----------------------------
Started phase 0, duration: 20s @ 11:46:06(+0800) 2020-06-22
Report @ 11:46:16(+0800) 2020-06-22
Elapsed time: 10 seconds
  Scenarios launched:  399
  Scenarios completed: 247
  Requests completed:  247
  Mean response/sec: 40.18
  Response time (msec):
    min: 240.3
    max: 3813.1
    median: 2101.6
    p95: 3654.7
    p99: 3812.3
  Codes:
    200: 247

Report @ 11:46:26(+0800) 2020-06-22
Elapsed time: 20 seconds
  Scenarios launched:  400
  Scenarios completed: 264
  Requests completed:  264
  Mean response/sec: 40.04
  Response time (msec):
    min: 3809.7
    max: 7204.4
    median: 5507.6
    p95: 7058.3
    p99: 7151.3
  Codes:
    200: 264

Warning:
CPU usage of Artillery seems to be very high (pids: 7524)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 11:46:36(+0800) 2020-06-22
Elapsed time: 30 seconds
  Scenarios launched:  1
  Scenarios completed: 264
  Requests completed:  264
  Mean response/sec: 0.1
  Response time (msec):
    min: 7222.7
    max: 10605
    median: 8912
    p95: 10404.2
    p99: 10558.4
  Codes:
    200: 264

Report @ 11:46:37(+0800) 2020-06-22
Elapsed time: 31 seconds
  Scenarios launched:  0
  Scenarios completed: 25
  Requests completed:  25
  Mean response/sec: NaN
  Response time (msec):
    min: 10603.4
    max: 10870.7
    median: 10765.9
    p95: 10869.8
    p99: 10870.7
  Codes:
    200: 25

All virtual users finished
Summary report @ 11:46:37(+0800) 2020-06-22
  Scenarios launched:  800
  Scenarios completed: 800
  Requests completed:  800
  Mean response/sec: 25.84
  Response time (msec):
    min: 240.3
    max: 10870.7
    median: 5782.1
    p95: 10399.1
    p99: 10831.7
  Scenario counts:
    0: 800 (100%)
  Codes:
    200: 800